<a href="https://colab.research.google.com/github/richardskimco/Training/blob/main/Data/AdventureWorks%20Sales/AdventureWorks%20Sales%20Project%20-%20Demo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Setup

In [ ]:
# @title Download database {"vertical-output":true}

!wget = "https://github.com/richardskimco/Training/raw/main/Data/AdventureWorks%20Sales/AdventureWorks_Sales.db"

In [ ]:
# @title Load SQL extension {"vertical-output":true}

%load_ext sql

In [ ]:
# @title Set database {"vertical-output":true}

%sql sqlite:///AdventureWorks_Sales.db

# Explore

In [ ]:
# @title Explore tables {"vertical-output":true}

%%sql
SELECT
name
FROM
sqlite_master
WHERE
TYPE = "table"
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('Customer',),
 ('Date',),
 ('Product',),
 ('Reseller',),
 ('Sales',),
 ('Sales_Order',),
 ('Sales_Territory',)]

In [ ]:
# @title Explore columns {"vertical-output":true}

%%sql
SELECT
*
FROM
Sales
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('43659001', '676', '-1', '349', '20170702', '20170712', '20170709', '5', '1', '2024.99', '2024.99', '0', '1898.09', '1898.09', '2024.99'),
 ('43659002', '676', '-1', '350', '20170702', '20170712', '20170709', '5', '3', '2024.99', '6074.98', '0', '1898.09', '5694.28', '6074.98'),
 ('43659003', '676', '-1', '351', '20170702', '20170712', '20170709', '5', '1', '2024.99', '2024.99', '0', '1898.09', '1898.09', '2024.99'),
 ('43659004', '676', '-1', '344', '20170702', '20170712', '20170709', '5', '1', '2039.99', '2039.99', '0', '1912.15', '1912.15', '2039.99'),
 ('43659005', '676', '-1', '345', '20170702', '20170712', '20170709', '5', '1', '2039.99', '2039.99', '0', '1912.15', '1912.15', '2039.99'),
 ('43659006', '676', '-1', '346', '20170702', '20170712', '20170709', '5', '2', '2039.99', '4079.99', '0', '1912.15', '3824.31', '4079.99'),
 ('43659007', '676', '-1', '347', '20170702', '20170712', '20170709', '5', '1', '2039.99', '2039.99', '0', '1912.15', '1912.15', '2039.99'),
 ('43659008', '676', '-1', '229', '20170702', '20170712', '20170709', '5', '3', '28.84', '86.52', '0', '31.72', '95.17', '86.52'),
 ('43659009', '676', '-1', '235', '20170702', '20170712', '20170709', '5', '1', '28.84', '28.84', '0', '31.72', '31.72', '28.84'),
 ('43659010', '676', '-1', '218', '20170702', '20170712', '20170709', '5', '6', '5.7', '34.2', '0', '3.4', '20.38', '34.2')]

# Module 1

## 1) SELECT

In [ ]:
# @title a. Get all data from the Customer table. {"vertical-output":true}

%%sql
SELECT
*
FROM
Customer AS c
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('-1', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]'),
 ('11000', 'AW00011000', 'Jon Yang', 'Rockhampton', 'Queensland', 'Australia', '4700'),
 ('11001', 'AW00011001', 'Eugene Huang', 'Seaford', 'Victoria', 'Australia', '3198'),
 ('11002', 'AW00011002', 'Ruben Torres', 'Hobart', 'Tasmania', 'Australia', '7001'),
 ('11003', 'AW00011003', 'Christy Zhu', 'North Ryde', 'New South Wales', 'Australia', '2113'),
 ('11004', 'AW00011004', 'Elizabeth Johnson', 'Wollongong', 'New South Wales', 'Australia', '2500'),
 ('11005', 'AW00011005', 'Julio Ruiz', 'East Brisbane', 'Queensland', 'Australia', '4169'),
 ('11006', 'AW00011006', 'Janet Alvarez', 'Matraville', 'New South Wales', 'Australia', '2036'),
 ('11007', 'AW00011007', 'Marco Mehta', 'Warrnambool', 'Victoria', 'Australia', '3280'),
 ('11008', 'AW00011008', 'Rob Verhoff', 'Bendigo', 'Victoria', 'Australia', '3550')]

In [ ]:
# @title b. Get the CustomerKey and Customer columns from the Customer table. {"vertical-output":true}

%%sql
SELECT
c.CustomerKey
, c.Customer
FROM
Customer AS c
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('-1', '[Not Applicable]'),
 ('11000', 'Jon Yang'),
 ('11001', 'Eugene Huang'),
 ('11002', 'Ruben Torres'),
 ('11003', 'Christy Zhu'),
 ('11004', 'Elizabeth Johnson'),
 ('11005', 'Julio Ruiz'),
 ('11006', 'Janet Alvarez'),
 ('11007', 'Marco Mehta'),
 ('11008', 'Rob Verhoff')]

In [ ]:
# @title c. Get the first 10 rows of the CustomerKey and Customer columns from the Customer table. {"vertical-output":true}

%%sql
SELECT
c.CustomerKey
, c.Customer
FROM
Customer AS c
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('-1', '[Not Applicable]'),
 ('11000', 'Jon Yang'),
 ('11001', 'Eugene Huang'),
 ('11002', 'Ruben Torres'),
 ('11003', 'Christy Zhu'),
 ('11004', 'Elizabeth Johnson'),
 ('11005', 'Julio Ruiz'),
 ('11006', 'Janet Alvarez'),
 ('11007', 'Marco Mehta'),
 ('11008', 'Rob Verhoff')]

## 2) DISTINCT

In [ ]:
# @title a. Get a unique list of ProductKeys and Products. {"vertical-output":true}

%%sql
SELECT DISTINCT
p.ProductKey
, p.Product
FROM
Product AS p
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('210', 'HL Road Frame - Black, 58'),
 ('211', 'HL Road Frame - Red, 58'),
 ('212', 'Sport-100 Helmet, Red'),
 ('213', 'Sport-100 Helmet, Red'),
 ('214', 'Sport-100 Helmet, Red'),
 ('215', 'Sport-100 Helmet, Black'),
 ('216', 'Sport-100 Helmet, Black'),
 ('217', 'Sport-100 Helmet, Black'),
 ('218', 'Mountain Bike Socks, M'),
 ('219', 'Mountain Bike Socks, L')]

## 3) CAST

In [ ]:
# @title a. Get CustomerKey as string data type and Sales_Amount as numeric data type from the Sales table. {"vertical-output":true}

%%sql
SELECT
CAST(s.CustomerKey AS STRING) AS CustomerKey_TEXT
, CAST(s.Sales_Amount AS NUMERIC) AS Sales_Amount_NUMERIC
FROM
Sales AS s
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[(-1, 2024.99),
 (-1, 6074.98),
 (-1, 2024.99),
 (-1, 2039.99),
 (-1, 2039.99),
 (-1, 4079.99),
 (-1, 2039.99),
 (-1, 86.52),
 (-1, 28.84),
 (-1, 34.2)]

# Module 2

## 1) ORDER BY

In [ ]:
# @title a. Get Products sorted by Standard_Cost in descending order. {"vertical-output":true}

%%sql
SELECT
p.ProductKey
, p.Product
, CAST(p.Standard_Cost AS NUMERIC) AS Standard_Cost
FROM
Product AS p
ORDER BY
Standard_Cost DESC
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('310', 'Road-150 Red, 62', 2171.29),
 ('311', 'Road-150 Red, 44', 2171.29),
 ('312', 'Road-150 Red, 48', 2171.29),
 ('313', 'Road-150 Red, 52', 2171.29),
 ('314', 'Road-150 Red, 56', 2171.29),
 ('344', 'Mountain-100 Silver, 38', 1912.15),
 ('345', 'Mountain-100 Silver, 42', 1912.15),
 ('346', 'Mountain-100 Silver, 44', 1912.15),
 ('347', 'Mountain-100 Silver, 48', 1912.15),
 ('348', 'Mountain-100 Black, 38', 1898.09)]

In [ ]:
# @title b. Get top 10 Products sorted by Standard_Cost in descending order. {"vertical-output":true}

%%sql
SELECT
p.ProductKey
, p.Product
, CAST(p.Standard_Cost AS NUMERIC) AS Standard_Cost
FROM
Product AS p
ORDER BY
Standard_Cost DESC
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('310', 'Road-150 Red, 62', 2171.29),
 ('311', 'Road-150 Red, 44', 2171.29),
 ('312', 'Road-150 Red, 48', 2171.29),
 ('313', 'Road-150 Red, 52', 2171.29),
 ('314', 'Road-150 Red, 56', 2171.29),
 ('344', 'Mountain-100 Silver, 38', 1912.15),
 ('345', 'Mountain-100 Silver, 42', 1912.15),
 ('346', 'Mountain-100 Silver, 44', 1912.15),
 ('347', 'Mountain-100 Silver, 48', 1912.15),
 ('348', 'Mountain-100 Black, 38', 1898.09)]

## 2) WHERE

In [ ]:
# @title a. Filter Products for "Sport-100" Model. {"vertical-output":true}

%%sql
SELECT
p.ProductKey
, p.Product
, p.Color
, p.Model
FROM
Product AS p
WHERE
p.Model = "Sport-100"
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('212', 'Sport-100 Helmet, Red', 'Red', 'Sport-100'),
 ('213', 'Sport-100 Helmet, Red', 'Red', 'Sport-100'),
 ('214', 'Sport-100 Helmet, Red', 'Red', 'Sport-100'),
 ('215', 'Sport-100 Helmet, Black', 'Black', 'Sport-100'),
 ('216', 'Sport-100 Helmet, Black', 'Black', 'Sport-100'),
 ('217', 'Sport-100 Helmet, Black', 'Black', 'Sport-100'),
 ('220', 'Sport-100 Helmet, Blue', 'Blue', 'Sport-100'),
 ('221', 'Sport-100 Helmet, Blue', 'Blue', 'Sport-100'),
 ('222', 'Sport-100 Helmet, Blue', 'Blue', 'Sport-100')]

In [ ]:
# @title b. Filter Products for Model "Sport-100" and Color "Red" or "Blue". {"vertical-output":true}

%%sql
SELECT
p.ProductKey
, p.Product
, p.Color
, p.Model
FROM
Product AS p
WHERE
p.Model = "Sport-100"
AND p.Color IN ("Red", "Blue")
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('212', 'Sport-100 Helmet, Red', 'Red', 'Sport-100'),
 ('213', 'Sport-100 Helmet, Red', 'Red', 'Sport-100'),
 ('214', 'Sport-100 Helmet, Red', 'Red', 'Sport-100'),
 ('220', 'Sport-100 Helmet, Blue', 'Blue', 'Sport-100'),
 ('221', 'Sport-100 Helmet, Blue', 'Blue', 'Sport-100'),
 ('222', 'Sport-100 Helmet, Blue', 'Blue', 'Sport-100')]

In [ ]:
# @title c. Filter Products ending in "M" for medium size (i.e. Mountain Bike Socks, M). {"vertical-output":true}

%%sql
SELECT
p.ProductKey
, p.Product
, p.Color
, p.Model
FROM
Product AS p
WHERE
p.Product LIKE "%, M"
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('218', 'Mountain Bike Socks, M', 'White', 'Mountain Bike Socks'),
 ('229', 'Long-Sleeve Logo Jersey, M', 'Multi', 'Long-Sleeve Logo Jersey'),
 ('230', 'Long-Sleeve Logo Jersey, M', 'Multi', 'Long-Sleeve Logo Jersey'),
 ('231', 'Long-Sleeve Logo Jersey, M', 'Multi', 'Long-Sleeve Logo Jersey'),
 ('453', "Men's Sports Shorts, M", 'Black', "Men's Sports Shorts"),
 ('457', "Women's Tights, M", 'Black', "Women's Tights"),
 ('460', "Men's Bib-Shorts, M", 'Multi', "Men's Bib-Shorts"),
 ('464', 'Half-Finger Gloves, M', 'Black', 'Half-Finger Gloves'),
 ('465', 'Half-Finger Gloves, M', 'Black', 'Half-Finger Gloves'),
 ('469', 'Full-Finger Gloves, M', 'Black', 'Full-Finger Gloves')]

# Module 3

## 1) COUNT & COUNT DISTINCT

In [ ]:
# @title a. Get the total count and the unique count of Customer from the Customer table. {"vertical-output":true}

%%sql
SELECT
COUNT(c.Customer) AS Customer_COUNT
, COUNT(DISTINCT c.Customer) AS Customer_COUNTD
FROM
Customer AS c
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[(18485, 18401)]

## 2) SUM & AVG

In [ ]:
# @title a. Get the sum and the averge of Sales_Amount from the Sales table. {"vertical-output":true}

%%sql
SELECT
SUM(CAST(s.Sales_Amount AS NUMERIC)) AS Sales_Amount_SUM
, AVG(CAST(s.Sales_Amount AS NUMERIC)) AS Sales_Amount_AVG
FROM
Sales AS s
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[(109809273.9997523, 905.6210897854263)]

## 3) MAX & MIN

In [ ]:
# @title a. Get the maximum and the minimum of Sales_Amount from the Sales table. {"vertical-output":true}

%%sql
SELECT
MAX(CAST(s.Sales_Amount AS NUMERIC)) AS Sales_Amount_MAX
, MIN(CAST(s.Sales_Amount AS NUMERIC)) AS Sales_Amount_MIN
FROM
Sales AS s
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[(27893.62, 1.37)]

## 4) GROUP BY

In [ ]:
# @title a. Get the sum of Sales_Amount by OrderDateKey. {"vertical-output":true}

%%sql
SELECT
s.OrderDateKey
, SUM(CAST(s.Sales_Amount AS NUMERIC)) AS Sales_Amount_SUM
FROM
Sales AS s
GROUP BY
s.OrderDateKey
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('20170701', 28408.86),
 ('20170702', 42734.31999999999),
 ('20170703', 29325.260000000002),
 ('20170704', 15711.28),
 ('20170705', 65487.03999999997),
 ('20170706', 28447.88),
 ('20170707', 100241.78000000004),
 ('20170708', 25543.710000000003),
 ('20170709', 26144.550000000003),
 ('20170710', 79590.26)]

In [ ]:
# @title b. Get the sum of Sales_Amount by OrderDateKey and CustomerKey. {"vertical-output":true}

%%sql
SELECT
s.OrderDateKey
, s.CustomerKey
, SUM(CAST(s.Sales_Amount AS NUMERIC)) AS Sales_Amount_SUM
FROM
Sales AS s
GROUP BY
s.OrderDateKey
, s.CustomerKey
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('20170701', '11003', 3399.99),
 ('20170701', '11005', 3374.99),
 ('20170701', '11011', 3399.99),
 ('20170701', '14501', 699.1),
 ('20170701', '16624', 3578.27),
 ('20170701', '21768', 3578.27),
 ('20170701', '25863', 3399.99),
 ('20170701', '27645', 3578.27),
 ('20170701', '28389', 3399.99),
 ('20170702', '-1', 20565.600000000002)]

In [ ]:
# @title c. Get the sum and the average of Sales_Amount by OrderDateKey. {"vertical-output":true}

%%sql
SELECT
s.OrderDateKey
, SUM(CAST(s.Sales_Amount AS NUMERIC)) AS Sales_Amount_SUM
, AVG(CAST(s.Sales_Amount AS NUMERIC)) AS Sales_Amount_AVG
FROM
Sales AS s
GROUP BY
s.OrderDateKey
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('20170701', 28408.86, 3156.54),
 ('20170702', 42734.31999999999, 2249.1747368421047),
 ('20170703', 29325.260000000002, 3258.3622222222225),
 ('20170704', 15711.28, 2618.5466666666666),
 ('20170705', 65487.03999999997, 2518.7323076923067),
 ('20170706', 28447.88, 3555.985),
 ('20170707', 100241.78000000004, 2004.8356000000008),
 ('20170708', 25543.710000000003, 3192.9637500000003),
 ('20170709', 26144.550000000003, 2178.7125),
 ('20170710', 79590.26, 1730.2230434782607)]

In [ ]:
# @title d. Get the sum and the average of Sales_Amount by OrderDateKey and CustomerKey. {"vertical-output":true}

%%sql
SELECT
s.OrderDateKey
, s.CustomerKey
, SUM(CAST(s.Sales_Amount AS NUMERIC)) AS Sales_Amount_SUM
, AVG(CAST(s.Sales_Amount AS NUMERIC)) AS Sales_Amount_AVG
FROM
Sales AS s
GROUP BY
s.OrderDateKey
, s.CustomerKey
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('20170701', '11003', 3399.99, 3399.99),
 ('20170701', '11005', 3374.99, 3374.99),
 ('20170701', '11011', 3399.99, 3399.99),
 ('20170701', '14501', 699.1, 699.1),
 ('20170701', '16624', 3578.27, 3578.27),
 ('20170701', '21768', 3578.27, 3578.27),
 ('20170701', '25863', 3399.99, 3399.99),
 ('20170701', '27645', 3578.27, 3578.27),
 ('20170701', '28389', 3399.99, 3399.99),
 ('20170702', '-1', 20565.600000000002, 1713.8000000000002)]

In [ ]:
# @title e. Get the sum of Sales_Amount by OrderDateKey for CustomerKey "11091". {"vertical-output":true}

%%sql
SELECT
s.OrderDateKey
, s.CustomerKey
, SUM(CAST(s.Sales_Amount AS NUMERIC)) AS Sales_Amount_SUM
FROM
Sales AS s
WHERE
s.CustomerKey = "11091"
GROUP BY
s.OrderDateKey
, s.CustomerKey
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('20190702', '11091', 13.98),
 ('20190712', '11091', 53.99),
 ('20190810', '11091', 58.47),
 ('20190815', '11091', 12.940000000000001),
 ('20190823', '11091', 74.48),
 ('20190904', '11091', 38.88),
 ('20190905', '11091', 27.769999999999996),
 ('20190920', '11091', 39.980000000000004),
 ('20190927', '11091', 4.99),
 ('20191006', '11091', 6.28)]

In [ ]:
# @title f. Get the sum of Sales_Amount by OrderDateKey for CustomerKey "11091" with over $100 in sales. {"vertical-output":true}

%%sql
SELECT
s.OrderDateKey
, s.CustomerKey
, SUM(CAST(s.Sales_Amount AS NUMERIC)) AS Sales_Amount_SUM
FROM
Sales AS s
WHERE
s.CustomerKey = "11091"
GROUP BY
s.OrderDateKey
, s.CustomerKey
HAVING
Sales_Amount_SUM > 100
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('20200104', '11091', 114.96000000000001), ('20200313', '11091', 144.49)]

# Module 4

## 1) INNER JOIN

In [ ]:
# @title a. Get only matching records between the Sales and Product tables, joining on ProductKey. Check if ProductKeys "212" and "210" are in the output. {"vertical-output":true}

%%sql
SELECT DISTINCT --distinct is optional
s.ProductKey AS ProductKey_Sales
, p.ProductKey AS ProductKey_Product
FROM
Sales AS s
INNER JOIN
Product AS p ON s.ProductKey = p.ProductKey
WHERE
s.ProductKey IN ('212', '210') --ProductKey 212 is in both the Sales and Product tables, ProductKey 210 is in only the Product table.
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('212', '212')]

## 2) LEFT JOIN

In [ ]:
# @title a. Get all existing records from the Sales table and only matching records from the Product table. Check if ProductKeys "212" and "210" are in the output. {"vertical-output":true}

%%sql
SELECT DISTINCT
s.ProductKey AS ProductKey_Sales
, p.ProductKey AS ProductKey_Product
FROM
Sales AS s
LEFT JOIN
Product AS p ON s.ProductKey = p.ProductKey
WHERE
s.ProductKey IN ('212', '210')
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('212', '212')]

## 3) RIGHT JOIN

In [ ]:
# @title a. Get only matching records from the Sales table and all existing records from the Product table. Check if ProductKeys "212" and "210" are in the output. {"vertical-output":true}

%%sql
SELECT DISTINCT
s.ProductKey AS ProductKey_Sales
, p.ProductKey AS ProductKey_Product
FROM
Sales AS s
RIGHT JOIN
Product AS p ON s.ProductKey = p.ProductKey
WHERE
s.ProductKey IN ('212', '210')
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT DISTINCT
s.ProductKey AS ProductKey_Sales
, p.ProductKey AS ProductKey_Product
FROM
Sales AS s
RIGHT JOIN
Product AS p ON s.ProductKey = p.ProductKey
WHERE
s.ProductKey IN ('212', '210')
LIMIT 10]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

## 4) FULL JOIN

In [ ]:
# @title a. Get all existing records across the Product and Sales table. Check if ProductKeys "212" and "210" are in the output. {"vertical-output":true}

%%sql
SELECT DISTINCT
s.ProductKey AS ProductKey_Sales
, p.ProductKey AS ProductKey_Product
FROM
Sales AS s
FULL JOIN
Product AS p ON s.ProductKey = p.ProductKey
WHERE
s.ProductKey IN ('212', '210')
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT DISTINCT
s.ProductKey AS ProductKey_Sales
, p.ProductKey AS ProductKey_Product
FROM
Sales AS s
FULL JOIN
Product AS p ON s.ProductKey = p.ProductKey
WHERE
s.ProductKey IN ('212', '210')
LIMIT 10]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

## 5) Multiple Joins

In [ ]:
# @title a. Join the Customer and Product tables to the Sales table. Get the sales data for CustomerKey "11445" including Customer, Product, OrderDateKey, Order_Quantity, and Sales_Amount. {"vertical-output":true}

%%sql
SELECT
s.CustomerKey
, c.CustomerKey
, c.Customer
, s.ProductKey
, p.ProductKey
, p.Product
, s.OrderDateKey
, s.Order_Quantity
, s.Sales_Amount
FROM
Sales AS s
LEFT JOIN
Customer AS c on s.CustomerKey = c.CustomerKey
LEFT JOIN
Product AS p on s.ProductKey = p.ProductKey
WHERE
s.CustomerKey = "11445"
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('11445', '11445', 'Kari Kim', '346', '346', 'Mountain-100 Silver, 44', '20171106', '1', '3399.99'),
 ('11445', '11445', 'Kari Kim', '359', '359', 'Mountain-200 Black, 38', '20190607', '1', '2294.99'),
 ('11445', '11445', 'Kari Kim', '478', '478', 'Mountain Bottle Cage', '20190607', '1', '9.99'),
 ('11445', '11445', 'Kari Kim', '576', '576', 'Touring-1000 Blue, 60', '20191129', '1', '2384.07'),
 ('11445', '11445', 'Kari Kim', '479', '479', 'Road Bottle Cage', '20191129', '1', '8.99')]

# Module 5

## 1) Subqueries

In [ ]:
# @title a. Join the Customer and Product tables to the Sales table. Get the sales data for CustomerKey "11445" including Customer, Product, OrderDateKey, Order_Quantity, and Sales_Amount. Using this query as subquery, calculate the sum of Order_Quantity and Sales_Amount by OrderDateKey for CustomerKey "11445". {"vertical-output":true}

%%sql
SELECT
sub.OrderDateKey
, SUM(CAST(sub.Order_Quantity AS NUMERIC)) AS Order_Quantity_SUM
, SUM(CAST(sub.Sales_Amount AS NUMERIC)) AS Sales_Amount_SUM
FROM (
  SELECT
  s.CustomerKey
  , c.CustomerKey
  , c.Customer
  , s.ProductKey
  , p.ProductKey
  , p.Product
  , s.OrderDateKey
  , s.Order_Quantity
  , s.Sales_Amount
  FROM
  Sales AS s
  LEFT JOIN
  Customer AS c on s.CustomerKey = c.CustomerKey
  LEFT JOIN
  Product AS p on s.ProductKey = p.ProductKey
  WHERE
  s.CustomerKey = "11445"
) sub
GROUP BY
sub.OrderDateKey
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('20171106', 1, 3399.99),
 ('20190607', 2, 2304.9799999999996),
 ('20191129', 2, 2393.06)]

# Project

## 1) Build a summary table combining key fields from all tables based on the [data model diagram](https://github.com/richardskimco/Training/blob/a58bc36c6e74d2aeb9bf8a10e1aba3c6090fa60d/Data/AdventureWorks%20Sales/Data%20Model%20Diagram.png).

In [ ]:
# @title a. Build a summary table. {"vertical-output":true}

%%sql
SELECT
--Sales
s.OrderDateKey
, s.Order_Quantity
, s.Sales_Amount
--Sales_Order
, so.SalesOrderLineKey
, so.Sales_Order
, so.Sales_Order_Line
--Sales_Territory
, st.SalesTerritoryKey
, st.Country
, st.Region
--Reseller
, r.ResellerKey
, r.Reseller
, r.Business_Type
, r.City AS Reseller_City
, r.State_Province AS Reseller_State_Province
, r.Country_Region AS Reseller_Country_Region
--Customer
, c.CustomerKey
, c.Customer
, c.City AS Customer_City
, c.State_Province AS Customer_State_Province
, c.Country_Region AS Customer_Country_Region
--Product
, p.ProductKey
, p.Product
, p.Category
, p.Subcategory
, p.Model
, p.Color
--Date
, d.Date
FROM
Sales AS s
LEFT JOIN
Sales_Order AS so ON s.SalesOrderLineKey = so.SalesOrderLineKey
LEFT JOIN
Sales_Territory AS st ON s.SalesTerritoryKey = st.SalesTerritoryKey
LEFT JOIN
Customer AS c ON s.CustomerKey = c.CustomerKey
LEFT JOIN
Product AS p ON s.ProductKey = p.ProductKey
LEFT JOIN
Reseller AS r ON s.ResellerKey = r.ResellerKey
LEFT JOIN
Date AS d ON s.OrderDateKey = d.DateKey
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('20170702', '1', '2024.99', '43659001', 'SO43659', 'SO43659 - 1', '5', 'United States', 'Southeast', '676', 'Better Bike Shop', 'Value Added Reseller', 'Austell', 'Georgia', 'United States', '-1', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '349', 'Mountain-100 Black, 42', 'Bikes', 'Mountain Bikes', 'Mountain-100', 'Black', '7/2/2017'),
 ('20170702', '3', '6074.98', '43659002', 'SO43659', 'SO43659 - 2', '5', 'United States', 'Southeast', '676', 'Better Bike Shop', 'Value Added Reseller', 'Austell', 'Georgia', 'United States', '-1', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '350', 'Mountain-100 Black, 44', 'Bikes', 'Mountain Bikes', 'Mountain-100', 'Black', '7/2/2017'),
 ('20170702', '1', '2024.99', '43659003', 'SO43659', 'SO43659 - 3', '5', 'United States', 'Southeast', '676', 'Better Bike Shop', 'Value Added Reseller', 'Austell', 'Georgia', 'United States', '-1', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '351', 'Mountain-100 Black, 48', 'Bikes', 'Mountain Bikes', 'Mountain-100', 'Black', '7/2/2017'),
 ('20170702', '1', '2039.99', '43659004', 'SO43659', 'SO43659 - 4', '5', 'United States', 'Southeast', '676', 'Better Bike Shop', 'Value Added Reseller', 'Austell', 'Georgia', 'United States', '-1', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '344', 'Mountain-100 Silver, 38', 'Bikes', 'Mountain Bikes', 'Mountain-100', 'Silver', '7/2/2017'),
 ('20170702', '1', '2039.99', '43659005', 'SO43659', 'SO43659 - 5', '5', 'United States', 'Southeast', '676', 'Better Bike Shop', 'Value Added Reseller', 'Austell', 'Georgia', 'United States', '-1', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '345', 'Mountain-100 Silver, 42', 'Bikes', 'Mountain Bikes', 'Mountain-100', 'Silver', '7/2/2017'),
 ('20170702', '2', '4079.99', '43659006', 'SO43659', 'SO43659 - 6', '5', 'United States', 'Southeast', '676', 'Better Bike Shop', 'Value Added Reseller', 'Austell', 'Georgia', 'United States', '-1', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '346', 'Mountain-100 Silver, 44', 'Bikes', 'Mountain Bikes', 'Mountain-100', 'Silver', '7/2/2017'),
 ('20170702', '1', '2039.99', '43659007', 'SO43659', 'SO43659 - 7', '5', 'United States', 'Southeast', '676', 'Better Bike Shop', 'Value Added Reseller', 'Austell', 'Georgia', 'United States', '-1', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '347', 'Mountain-100 Silver, 48', 'Bikes', 'Mountain Bikes', 'Mountain-100', 'Silver', '7/2/2017'),
 ('20170702', '3', '86.52', '43659008', 'SO43659', 'SO43659 - 8', '5', 'United States', 'Southeast', '676', 'Better Bike Shop', 'Value Added Reseller', 'Austell', 'Georgia', 'United States', '-1', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '229', 'Long-Sleeve Logo Jersey, M', 'Clothing', 'Jerseys', 'Long-Sleeve Logo Jersey', 'Multi', '7/2/2017'),
 ('20170702', '1', '28.84', '43659009', 'SO43659', 'SO43659 - 9', '5', 'United States', 'Southeast', '676', 'Better Bike Shop', 'Value Added Reseller', 'Austell', 'Georgia', 'United States', '-1', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '235', 'Long-Sleeve Logo Jersey, XL', 'Clothing', 'Jerseys', 'Long-Sleeve Logo Jersey', 'Multi', '7/2/2017'),
 ('20170702', '6', '34.2', '43659010', 'SO43659', 'SO43659 - 10', '5', 'United States', 'Southeast', '676', 'Better Bike Shop', 'Value Added Reseller', 'Austell', 'Georgia', 'United States', '-1', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '[Not Applicable]', '218', 'Mountain Bike Socks, M', 'Clothing', 'Socks', 'Mountain Bike Socks', 'White', '7/2/2017')]

## 2) Using the summary table as subquery, build views visualizing the sales data and write summaries analyzing the questions below.

In [ ]:
# @title a. Sales Amount by Order Date - Which day had the most sales in February 2019? {"vertical-output":true}

%%sql
SELECT
summary.OrderDateKey
, SUM(CAST(summary.Sales_Amount AS NUMERIC)) AS Sales_Amount_SUM
FROM (
  SELECT
  --Sales
  s.OrderDateKey
  , s.Order_Quantity
  , s.Sales_Amount
  --Sales_Order
  , so.SalesOrderLineKey
  , so.Sales_Order
  , so.Sales_Order_Line
  --Sales_Territory
  , st.SalesTerritoryKey
  , st.Country
  , st.Region
  --Reseller
  , r.ResellerKey
  , r.Reseller
  , r.Business_Type
  , r.City AS Reseller_City
  , r.State_Province AS Reseller_State_Province
  , r.Country_Region AS Reseller_Country_Region
  --Customer
  , c.CustomerKey
  , c.Customer
  , c.City AS Customer_City
  , c.State_Province AS Customer_State_Province
  , c.Country_Region AS Customer_Country_Region
  --Product
  , p.ProductKey
  , p.Product
  , p.Category
  , p.Subcategory
  , p.Model
  , p.Color
  --Date
  , d.Date
  FROM
  Sales AS s
  LEFT JOIN
  Sales_Order AS so ON s.SalesOrderLineKey = so.SalesOrderLineKey
  LEFT JOIN
  Sales_Territory AS st ON s.SalesTerritoryKey = st.SalesTerritoryKey
  LEFT JOIN
  Customer AS c ON s.CustomerKey = c.CustomerKey
  LEFT JOIN
  Product AS p ON s.ProductKey = p.ProductKey
  LEFT JOIN
  Reseller AS r ON s.ResellerKey = r.ResellerKey
  LEFT JOIN
  Date AS d ON s.OrderDateKey = d.DateKey
) summary
WHERE
(summary.OrderDateKey >= '20190201' AND summary.OrderDateKey <= '20190228')
GROUP BY
summary.OrderDateKey
ORDER BY
Sales_Amount_SUM DESC
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('20190225', 253915.44999999992),
 ('20190212', 230339.13000000006),
 ('20190228', 166175.07999999993),
 ('20190220', 162956.99),
 ('20190203', 153861.19999999998),
 ('20190211', 143003.67999999993),
 ('20190208', 140833.53),
 ('20190227', 138317.25000000003),
 ('20190217', 135745.72999999995),
 ('20190215', 123161.62)]

In [ ]:
# @title b. Order Quantity by Reseller Country/Region - Which country/region had the most orders in February 2019? {"vertical-output":true}

%%sql
SELECT
summary.Reseller_Country_Region
, SUM(CAST(summary.Order_Quantity AS NUMERIC)) AS Order_Quantity_SUM
FROM (
  SELECT
  --Sales
  s.OrderDateKey
  , s.Order_Quantity
  , s.Sales_Amount
  --Sales_Order
  , so.SalesOrderLineKey
  , so.Sales_Order
  , so.Sales_Order_Line
  --Sales_Territory
  , st.SalesTerritoryKey
  , st.Country
  , st.Region
  --Reseller
  , r.ResellerKey
  , r.Reseller
  , r.Business_Type
  , r.City AS Reseller_City
  , r.State_Province AS Reseller_State_Province
  , r.Country_Region AS Reseller_Country_Region
  --Customer
  , c.CustomerKey
  , c.Customer
  , c.City AS Customer_City
  , c.State_Province AS Customer_State_Province
  , c.Country_Region AS Customer_Country_Region
  --Product
  , p.ProductKey
  , p.Product
  , p.Category
  , p.Subcategory
  , p.Model
  , p.Color
  --Date
  , d.Date
  FROM
  Sales AS s
  LEFT JOIN
  Sales_Order AS so ON s.SalesOrderLineKey = so.SalesOrderLineKey
  LEFT JOIN
  Sales_Territory AS st ON s.SalesTerritoryKey = st.SalesTerritoryKey
  LEFT JOIN
  Customer AS c ON s.CustomerKey = c.CustomerKey
  LEFT JOIN
  Product AS p ON s.ProductKey = p.ProductKey
  LEFT JOIN
  Reseller AS r ON s.ResellerKey = r.ResellerKey
  LEFT JOIN
  Date AS d ON s.OrderDateKey = d.DateKey
) summary
WHERE
(summary.OrderDateKey >= '20190201' AND summary.OrderDateKey <= '20190228')
GROUP BY
summary.Reseller_Country_Region
ORDER BY
Order_Quantity_SUM DESC
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('United States', 3579),
 ('Canada', 917),
 ('France', 394),
 ('United Kingdom', 269),
 ('[Not Applicable]', 246)]

In [ ]:
# @title c. Sales Amount by Product Category and Reseller Business Type - Which product category and reseller business type should the company continue to invest in February 2019? {"vertical-output":true}

%%sql
SELECT
summary.Category
, summary.Business_Type
, SUM(CAST(summary.Sales_Amount AS NUMERIC)) AS Sales_Amount_SUM
FROM (
  SELECT
  --Sales
  s.OrderDateKey
  , s.Order_Quantity
  , s.Sales_Amount
  --Sales_Order
  , so.SalesOrderLineKey
  , so.Sales_Order
  , so.Sales_Order_Line
  --Sales_Territory
  , st.SalesTerritoryKey
  , st.Country
  , st.Region
  --Reseller
  , r.ResellerKey
  , r.Reseller
  , r.Business_Type
  , r.City AS Reseller_City
  , r.State_Province AS Reseller_State_Province
  , r.Country_Region AS Reseller_Country_Region
  --Customer
  , c.CustomerKey
  , c.Customer
  , c.City AS Customer_City
  , c.State_Province AS Customer_State_Province
  , c.Country_Region AS Customer_Country_Region
  --Product
  , p.ProductKey
  , p.Product
  , p.Category
  , p.Subcategory
  , p.Model
  , p.Color
  --Date
  , d.Date
  FROM
  Sales AS s
  LEFT JOIN
  Sales_Order AS so ON s.SalesOrderLineKey = so.SalesOrderLineKey
  LEFT JOIN
  Sales_Territory AS st ON s.SalesTerritoryKey = st.SalesTerritoryKey
  LEFT JOIN
  Customer AS c ON s.CustomerKey = c.CustomerKey
  LEFT JOIN
  Product AS p ON s.ProductKey = p.ProductKey
  LEFT JOIN
  Reseller AS r ON s.ResellerKey = r.ResellerKey
  LEFT JOIN
  Date AS d ON s.OrderDateKey = d.DateKey
) summary
WHERE
(summary.OrderDateKey >= '20190201' AND summary.OrderDateKey <= '20190228')
GROUP BY
summary.Category
, summary.Business_Type
ORDER BY
Sales_Amount_SUM DESC
LIMIT 10

 * sqlite:///AdventureWorks_Sales.db
Done.

[('Bikes', 'Value Added Reseller', 1407525.22),
 ('Bikes', 'Warehouse', 587282.7899999995),
 ('Bikes', '[Not Applicable]', 444515.0999999989),
 ('Bikes', 'Specialty Bike Shop', 159560.31999999995),
 ('Components', 'Warehouse', 157917.25),
 ('Components', 'Value Added Reseller', 25314.389999999996),
 ('Clothing', 'Warehouse', 25177.480000000025),
 ('Clothing', 'Value Added Reseller', 13634.089999999991),
 ('Accessories', 'Warehouse', 4472.999999999999),
 ('Clothing', 'Specialty Bike Shop', 2871.99)]

## 3) (Optional) Using the summary table and its views, build a report visualizing the sales data.